{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 1662], "dtype": "float32", "sparse": false, "ragged": false, "name": "lstm_input"}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "batch_input_shape": [null, 30, 1662], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "categorical_accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2954021453857422, "scale": 0.002172074598424575, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07888657950303134, "scale": 0.0005843450333557876, "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2920642375946045, "scale": 0.0022126078605651856, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08981292054933661, "scale": 0.0006280623814638924, "original_dtype": "float32"}}, {"name": "dense_2/kernel", "shape": [32, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.38815912323839524, "scale": 0.0031557652295804493, "original_dtype": "float32"}}, {"name": "dense_2/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07418306142676111, "scale": 0.0005298790101911508, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/kernel", "shape": [1662, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.3234192810806573, "scale": 0.007694298145817775, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24786099213011123, "scale": 0.0019516613553552066, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.028867356690998172, "scale": 0.004123908098714025, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [64, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24767342151380056, "scale": 0.0020468877811057897, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3085952807875241, "scale": 0.002706976147258983, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03761179065879653, "scale": 0.0041790878509773925, "original_dtype": "float32"}}, {"name": "lstm_2/lstm_cell_2/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4290313380606034, "scale": 0.0032750483821420108, "original_dtype": "float32"}}, {"name": "lstm_2/lstm_cell_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.28995558794806986, "scale": 0.0023012348249846814, "original_dtype": "float32"}}, {"name": "lstm_2/lstm_cell_2/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.047188240333515055, "scale": 0.00428984003031955, "original_dtype": "float32"}}]}]}