{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 1662], "dtype": "float32", "sparse": false, "ragged": false, "name": "lstm_input"}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "batch_input_shape": [null, 30, 1662], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "categorical_accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4349324825931998, "scale": 0.0032217220932829614, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1886003954737794, "scale": 0.0015209709312401566, "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4494093235801248, "scale": 0.0036537343380497952, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1291128545999527, "scale": 0.0019863516092300413, "original_dtype": "float32"}}, {"name": "dense_2/kernel", "shape": [32, 10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4213065803050995, "scale": 0.0035403914311352897, "original_dtype": "float32"}}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3427428292293175, "scale": 0.0027640550744299796, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/kernel", "shape": [1662, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.44600238239063933, "scale": 0.006281723695642808, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2551073908805847, "scale": 0.0021437595872318043, "original_dtype": "float32"}}, {"name": "lstm/lstm_cell/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06590195745229721, "scale": 0.004393463830153147, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [64, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5499789237976074, "scale": 0.0040439626749824075, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.370947052450741, "scale": 0.002967576419605928, "original_dtype": "float32"}}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07737097144126892, "scale": 0.004551233614192289, "original_dtype": "float32"}}, {"name": "lstm_2/lstm_cell_2/kernel", "shape": [128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.378918779480691, "scale": 0.003678823101754282, "original_dtype": "float32"}}, {"name": "lstm_2/lstm_cell_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3755056297077852, "scale": 0.002802280818714815, "original_dtype": "float32"}}, {"name": "lstm_2/lstm_cell_2/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0959999584684185, "scale": 0.004799997923420925, "original_dtype": "float32"}}]}]}